solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
/*
 * Copyright 2021-2022, 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_pf5020.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define PF5020_REGULATOR_PG_EN_MASK  (0x1U)
#define PF5020_REGULATOR_PG_EN_SHIFT (0U)
#define PF5020_REGULATOR_PG_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_REGULATOR_PG_EN_SHIFT)) & PF5020_REGULATOR_PG_EN_MASK)

#define PF5020_REGULATOR_WDBYPASS_MASK  (0x2U)
#define PF5020_REGULATOR_WDBYPASS_SHIFT (1U)
#define PF5020_REGULATOR_WDBYPASS(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_REGULATOR_WDBYPASS_SHIFT)) & PF5020_REGULATOR_WDBYPASS_MASK)

#define PF5020_REGULATOR_ILIM_BYPASS_MASK  (0x20U)
#define PF5020_REGULATOR_ILIM_BYPASS_SHIFT (5U)
#define PF5020_REGULATOR_ILIM_BYPASS(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_REGULATOR_ILIM_BYPASS_SHIFT)) & PF5020_REGULATOR_ILIM_BYPASS_MASK)

#define PF5020_REGULATOR_OV_BYPASS_MASK  (0x40U)
#define PF5020_REGULATOR_OV_BYPASS_SHIFT (6U)
#define PF5020_REGULATOR_OV_BYPASS(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_REGULATOR_OV_BYPASS_SHIFT)) & PF5020_REGULATOR_OV_BYPASS_MASK)

#define PF5020_REGULATOR_UV_BYPASS_MASK  (0x80U)
#define PF5020_REGULATOR_UV_BYPASS_SHIFT (7U)
#define PF5020_REGULATOR_UV_BYPASS(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_REGULATOR_UV_BYPASS_SHIFT)) & PF5020_REGULATOR_UV_BYPASS_MASK)

#define PF5020_REGULATOR_FLT_REN_MASK  (0x80U)
#define PF5020_REGULATOR_FLT_REN_SHIFT (7U)
#define PF5020_REGULATOR_FLT_REN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_REGULATOR_FLT_REN_SHIFT)) & PF5020_REGULATOR_FLT_REN_MASK)

#define PF5020_BUCK_REGULATOR_RUN_MODE_MASK  (0x3U)
#define PF5020_BUCK_REGULATOR_RUN_MODE_SHIFT (0U)
#define PF5020_BUCK_REGULATOR_RUN_MODE(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_BUCK_REGULATOR_RUN_MODE_SHIFT)) & PF5020_BUCK_REGULATOR_RUN_MODE_MASK)

#define PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK  (0xCU)
#define PF5020_BUCK_REGULATOR_STANDBY_MODE_SHIFT (2U)
#define PF5020_BUCK_REGULATOR_STANDBY_MODE(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_BUCK_REGULATOR_STANDBY_MODE_SHIFT)) & PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK)

#define PF5020_BUCK_REGULATOR_ILIM_MASK  (0x18U)
#define PF5020_BUCK_REGULATOR_ILIM_SHIFT (3U)
#define PF5020_BUCK_REGULATOR_ILIM(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_BUCK_REGULATOR_ILIM_SHIFT)) & PF5020_BUCK_REGULATOR_ILIM_MASK)

#define PF5020_BUCK_REGULATOR_PDGPR_MASK  (0x30U)
#define PF5020_BUCK_REGULATOR_PDGPR_SHIFT (4U)
#define PF5020_BUCK_REGULATOR_PDGPR(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_BUCK_REGULATOR_PDGPR_SHIFT)) & PF5020_BUCK_REGULATOR_PDGPR_MASK)

#define PF5020_BUCK_REGULATOR_PHASE_MASK  (0x7U)
#define PF5020_BUCK_REGULATOR_PHASE_SHIFT (0U)
#define PF5020_BUCK_REGULATOR_PHASE(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_BUCK_REGULATOR_PHASE_SHIFT)) & PF5020_BUCK_REGULATOR_PHASE_MASK)

#define PF5020_SW2_CONFIG2_VTTEN_MASK  (0x40U)
#define PF5020_SW2_CONFIG2_VTTEN_SHIFT (6U)
#define PF5020_SW2_CONFIG2_VTTEN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_SW2_CONFIG2_VTTEN_SHIFT)) & PF5020_SW2_CONFIG2_VTTEN_MASK)

#define PF5020_LDO1_CONFIG2_STBY_EN_MASK  (0x1U)
#define PF5020_LDO1_CONFIG2_STBY_EN_SHIFT (0U)
#define PF5020_LDO1_CONFIG2_STBY_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_LDO1_CONFIG2_STBY_EN_SHIFT)) & PF5020_LDO1_CONFIG2_STBY_EN_MASK)

#define PF5020_LDO1_CONFIG2_RUN_EN_MASK  (0x2U)
#define PF5020_LDO1_CONFIG2_RUN_EN_SHIFT (1U)
#define PF5020_LDO1_CONFIG2_RUN_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_LDO1_CONFIG2_RUN_EN_SHIFT)) & PF5020_LDO1_CONFIG2_RUN_EN_MASK)

#define PF5020_LDO1_CONFIG2_LDO1_PDGRP_MASK  (0x60U)
#define PF5020_LDO1_CONFIG2_LDO1_PDGRP_SHIFT (5U)
#define PF5020_LDO1_CONFIG2_LDO1_PDGRP(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_LDO1_CONFIG2_LDO1_PDGRP_SHIFT)) & PF5020_LDO1_CONFIG2_LDO1_PDGRP_MASK)

#define PF5020_CTRL1_WD_STBY_EN_MASK  (0x4U)
#define PF5020_CTRL1_WD_STBY_EN_SHIFT (2U)
#define PF5020_CTRL1_WD_STBY_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL1_WD_STBY_EN_SHIFT)) & PF5020_CTRL1_WD_STBY_EN_MASK)

#define PF5020_CTRL1_WD_EN_MASK  (0x8U)
#define PF5020_CTRL1_WD_EN_SHIFT (3U)
#define PF5020_CTRL1_WD_EN(x)    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL1_WD_EN_SHIFT)) & PF5020_CTRL1_WD_EN_MASK)

#define PF5020_CTRL1_TMP_MON_EN_MASK  (0x10U)
#define PF5020_CTRL1_TMP_MON_EN_SHIFT (4U)
#define PF5020_CTRL1_TMP_MON_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL1_TMP_MON_EN_SHIFT)) & PF5020_CTRL1_TMP_MON_EN_MASK)

#define PF5020_CTRL2_TMP_MON_AON_MASK  (0x10U)
#define PF5020_CTRL2_TMP_MON_AON_SHIFT (4U)
#define PF5020_CTRL2_TMP_MON_AON(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL2_TMP_MON_AON_SHIFT)) & PF5020_CTRL2_TMP_MON_AON_MASK)

#define PF5020_CTRL3_PMIC_OFF_MASK  (0x2U)
#define PF5020_CTRL3_PMIC_OFF_SHIFT (1U)
#define PF5020_CTRL3_PMIC_OFF(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL3_PMIC_OFF_SHIFT)) & PF5020_CTRL3_PMIC_OFF_MASK)

#define PF5020_CTRL3_UV_DB_MASK  (0x30U)
#define PF5020_CTRL3_UV_DB_SHIFT (4U)
#define PF5020_CTRL3_UV_DB(x)    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL3_UV_DB_SHIFT)) & PF5020_CTRL3_UV_DB_MASK)

#define PF5020_CTRL3_OV_DB_MASK  (0xC0U)
#define PF5020_CTRL3_OV_DB_SHIFT (6U)
#define PF5020_CTRL3_OV_DB(x)    (((uint8_t)(((uint8_t)(x)) << PF5020_CTRL3_OV_DB_SHIFT)) & PF5020_CTRL3_OV_DB_MASK)

#define PF5020_AMUX_AMUX_SEL_MASK  (0x1FU)
#define PF5020_AMUX_MAUX_SEL_SHIFT (0U)
#define PF5020_AMUX_MAUX_SEL(x)    (((uint8_t)(((uint8_t)(x)) << PF5020_AMUX_MAUX_SEL_SHIFT)) & PF5020_AMUX_AMUX_SEL_MASK)

#define PF5020_AMUX_AMUX_EN_MASK  (0x20U)
#define PF5020_AMUX_AMUX_EN_SHIFT (5U)
#define PF5020_AMUX_AMUX_EN(x)    (((uint8_t)(((uint8_t)(x)) << PF5020_AMUX_AMUX_EN_SHIFT)) & PF5020_AMUX_AMUX_EN_MASK)

#define PF5020_VMONEN1_SW1VMON_EN_MASK  (0x1U)
#define PF5020_VMONEN1_SW1VMON_EN_SHIFT (0U)
#define PF5020_VMONEN1_SW1VMON_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_VMONEN1_SW1VMON_EN_SHIFT)) & PF5020_VMONEN1_SW1VMON_EN_MASK)

