solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
#define PF5020_VMONEN1_SW2VMON_EN_MASK  (0x2U)
#define PF5020_VMONEN1_SW2VMON_EN_SHIFT (1U)
#define PF5020_VMONEN1_SW2VMON_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_VMONEN1_SW2VMON_EN_SHIFT)) & PF5020_VMONEN1_SW2VMON_EN_MASK)

#define PF5020_VMONEN1_SWND1VMON_EN_MASK  (0x40U)
#define PF5020_VMONEN1_SWND1VMON_EN_SHIFT (6U)
#define PF5020_VMONEN1_SWND1VMON_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_VMONEN1_SWND1VMON_EN_SHIFT)) & PF5020_VMONEN1_SWND1VMON_EN_MASK)

#define PF5020_VMONEN2_LDO1VMON_EN_MASK  (0x1U)
#define PF5020_VMONEN2_LDO1VMON_EN_SHIFT (0U)
#define PF5020_VMONEN2_LDO1VMON_EN(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_VMONEN2_LDO1VMON_EN_SHIFT)) & PF5020_VMONEN2_LDO1VMON_EN_MASK)

#define PF5020_PWRUP_CTRL_RESETBMCU_PDGRP_MASK  (0xCU)
#define PF5020_PWRUP_CTRL_RESETBMCU_PDGRP_SHIFT (2U)
#define PF5020_PWRUP_CTRL_RESETBMCU_PDGRP(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_PWRUP_CTRL_RESETBMCU_PDGRP_SHIFT)) & PF5020_PWRUP_CTRL_RESETBMCU_PDGRP_MASK)

#define PF5020_PWRUP_CTRL_PGOOD_PDGRP_MASK  (0x30U)
#define PF5020_PWRUP_CTRL_PGOOD_PDGRP_SHIFT (4U)
#define PF5020_PWRUP_CTRL_PGOOD_PDGRP(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_PWRUP_CTRL_PGOOD_PDGRP_SHIFT)) & PF5020_PWRUP_CTRL_PGOOD_PDGRP_MASK)

#define PF5020_PWRUP_CTRL_PWRDWN_MODE_MASK  (0x40U)
#define PF5020_PWRUP_CTRL_PWRDWN_MODE_SHIFT (6U)
#define PF5020_PWRUP_CTRL_PWRDWN_MODE(x) \
    (((uint8_t)(((uint8_t)(x)) << PF5020_PWRUP_CTRL_PWRDWN_MODE_SHIFT)) & PF5020_PWRUP_CTRL_PWRDWN_MODE_MASK)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t PF5020_SetRegulatorCommonConfig(pf5020_handle_t *handle,
                                                pf5020_regulator_name_t regulatorName,
                                                bool enableUVBypass,
                                                bool enableOVBypass,
                                                bool enableWatchdogBypass,
                                                bool enablePGMonitor,
                                                bool faultReEnabled,
                                                bool enableILIMBypass);

static status_t PF5020_MaskInterrupts(pf5020_handle_t *handle, uint64_t interruptMask, bool enableMask);

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static status_t PF5020_SetRegulatorCommonConfig(pf5020_handle_t *handle,
                                                pf5020_regulator_name_t regulatorName,
                                                bool enableUVBypass,
                                                bool enableOVBypass,
                                                bool enableWatchdogBypass,
                                                bool enablePGMonitor,
                                                bool faultReEnabled,
                                                bool enableILIMBypass)
{
    assert(handle);

    uint8_t regAddrShift;
    uint8_t tmp8;
    status_t status = kStatus_Success;

    /* Calculate register address shift based on regulator name. */
    if (regulatorName == kPF5020_RegulatorLdo1)
    {
        regAddrShift = ((uint8_t)regulatorName - 1U) * 8U + 7U;
    }
    else
    {
        regAddrShift = (uint8_t)regulatorName * 8U;
    }

    tmp8 = PF5020_REGULATOR_PG_EN(enablePGMonitor) | PF5020_REGULATOR_WDBYPASS(enableWatchdogBypass) |
           PF5020_REGULATOR_ILIM_BYPASS(enableILIMBypass) | PF5020_REGULATOR_OV_BYPASS(enableOVBypass) |
           PF5020_REGULATOR_UV_BYPASS(enableUVBypass);

    status = PF5020_ModifyReg(handle, PF5020_SW2_CONFIG1 + regAddrShift, 0xE3U, tmp8);

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_SW1_CONFIG2 + regAddrShift, 0x80U,
                                  PF5020_REGULATOR_FLT_REN(faultReEnabled));
    }

    return status;
}

static status_t PF5020_MaskInterrupts(pf5020_handle_t *handle, uint64_t interruptMask, bool enableMask)
{
    static const uint8_t maskRegArray[] = PF5020_INT_MASK_ARRAY;
    uint8_t maskReg;
    uint8_t regIndex;
    uint64_t tmp64;
    uint8_t maskRegValue;
    status_t status = kStatus_Success;

    for (regIndex = 0U; regIndex < 7U; regIndex++)
    {
        /* Get each interrupt mask register's value. */
        tmp64 = interruptMask & (0xFFULL << (regIndex * 8U));

        if (tmp64 != 0ULL)
        {
            if ((tmp64 & (uint64_t)kPF5020_ILIM_Ldo1IlimInterrupt) != 0ULL)
            {
                tmp64 &= (uint64_t)(~(uint64_t)kPF5020_ILIM_Ldo1IlimInterrupt);
                status = PF5020_WriteReg(handle, PF5020_LDO_ILIM_MASK, enableMask ? 0U : 1U);
            }
            if ((tmp64 & (uint64_t)kPF5020_UV_Ldo1UvInterrupt) != 0ULL)
            {
                tmp64 &= (uint64_t)(~(uint64_t)kPF5020_UV_Ldo1UvInterrupt);
                status = PF5020_WriteReg(handle, PF5020_LDO_UV_MASK, enableMask ? 0U : 1U);
            }

            if ((tmp64 & (uint64_t)kPF5020_OV_Ldo1OvInterrupt) != 0UL)
            {
                tmp64 &= (uint64_t)(~(uint64_t)kPF5020_OV_Ldo1OvInterrupt);
                status = PF5020_WriteReg(handle, PF5020_LDO_OV_MASK, enableMask ? 0U : 1U);
            }
            if (status == kStatus_Success)
            {
                maskRegValue = (uint8_t)((tmp64 >> (regIndex * 8U)) & 0xFFU);
                maskReg      = maskRegArray[regIndex];
                status = PF5020_ModifyReg(handle, maskReg, maskRegValue, enableMask ? (~maskRegValue) : maskRegValue);
            }
        }
    }

