solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    return status;
}

/*!
 * brief Write to PF5020 register via I2C.
 *
 * param handle The pointer to pf5020_handle_t.
 * param regAddr The address of register to write.
 * param val The value to be write.
 *
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WriteReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t val)
{
    assert(handle);
    assert(handle->I2C_SendFunc);

    return handle->I2C_SendFunc(handle->slaveAddress, regAddr, 1U, &val, 1U);
}

/*!
 * brief Read value from PF5020 register via I2C.
 *
 * param handle The pointer to pf5020_handle_t.
 * param regAddr The address of register to write.
 * param val Pointer store return value.
 *
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_ReadReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t *val)
{
    assert(handle);
    assert(handle->I2C_ReceiveFunc);

    return handle->I2C_ReceiveFunc(handle->slaveAddress, regAddr, 1U, val, 1U);
}

/*!
 * brief Read and modify the register value
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param regAddr The address of register.
 * param mask The mask of register bit to be modified.
 * param val The value to be set.
 *
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_ModifyReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t mask, uint8_t val)
{
    assert(handle);

    status_t status = kStatus_Success;
    uint8_t tmp8;

    status = PF5020_ReadReg(handle, regAddr, &tmp8);

    if (status == kStatus_Success)
    {
        tmp8 &= (uint8_t)~mask;
        tmp8 |= (val & mask);
        status = PF5020_WriteReg(handle, regAddr, tmp8);
    }

    return status;
}

/*!
 * brief Dump the value of continuous registers.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param regAddr The address of start register.
 * param buffer The buffer to store the dumped registers' value.
 * param length The length of the continuous registers to be dumped.
 *
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_DumpReg(pf5020_handle_t *handle, uint8_t regAddr, uint8_t *buffer, uint8_t length)
{
    assert(handle);
    assert(handle->I2C_ReceiveFunc);

    uint8_t i       = 0U;
    status_t status = kStatus_Success;

    for (i = 0U; i < length; i++)
    {
        status = PF5020_ReadReg(handle, regAddr++, buffer++);
        if (status != kStatus_Success)
        {
            /* In case of fail to read register. */
            break;
        }
    }

    return status;
}

/*!
 * brief Get default initialize configuration.
 *
 * code
 *   config->I2C_SendFunc = NULL;
 *   config->I2C_ReceiveFunc = NULL;
 *   config->slaveAddress = 0x08U;
 * endcode
 * param config The pointer to pf5020_config_t structure.
 */
void PF5020_GetDefaultConfig(pf5020_config_t *config)
{
    assert(config);

    config->I2C_SendFunc    = NULL;
    config->I2C_ReceiveFunc = NULL;
    /* In default, the slave address of PF5020 is 0x08. */
    config->slaveAddress = 0x08U;
}

/*!
 * brief Initialize runtime handle.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config The pointer to pf5020_config_t structure.
 */
void PF5020_CreateHandle(pf5020_handle_t *handle, const pf5020_config_t *config)
{
    assert(handle);
    assert(config);

    handle->I2C_SendFunc    = config->I2C_SendFunc;
    handle->I2C_ReceiveFunc = config->I2C_ReceiveFunc;
    handle->slaveAddress    = config->slaveAddress;
}

/*!
 * brief Set power up sequencer time base.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param timeBase The time base value to set, please refer pf5020_sequencer_time_base_t for details.
 *
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetSequencerTimeBase(pf5020_handle_t *handle, pf5020_sequencer_time_base_t timeBase)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_PWRUP_CTRL, 0x3U, (uint8_t)timeBase & 0x3U);
}

/*!
 * brief Set power up sequence, when transitioning from standby state to run state, the power up sequencer is activated
 * only if any of the regulators is re-enabled during this transition.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param powerUpSeq The pointer to pf5020_power_up_sequence_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerUpSequence(pf5020_handle_t *handle, pf5020_power_up_sequence_t *powerUpSeq)
{
    assert(handle);
    assert(powerUpSeq);

    static const uint8_t seqReqArray[] = PF5020_SEQ_REG_ARRAY;
    uint8_t tmp8;
    uint8_t i;
    status_t status;

    for (i = 0U; i < 6U; i++)
    {
        status = PF5020_ReadReg(handle, seqReqArray[i], &tmp8);
        /* if the sequence order to set is same as register value, it is no need to set register again. */
        if ((tmp8 != *((uint8_t *)powerUpSeq + i)) && (status == kStatus_Success))
        {
            status = PF5020_WriteReg(handle, seqReqArray[i], *((uint8_t *)powerUpSeq + i));
        }

        if (status != kStatus_Success)
        {
            break;
        }
    }

