solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    return status;
}

/*!
 * brief Set power down mode, sequential mode or group mode.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param powerDownMode The power down mode to set, please refer to pf5020_power_down_mode_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerDownMode(pf5020_handle_t *handle, pf5020_power_down_mode_t powerDownMode)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_PWRUP_CTRL, PF5020_PWRUP_CTRL_PWRDWN_MODE_MASK,
                            PF5020_PWRUP_CTRL_PWRDWN_MODE(powerDownMode));
}

/*!
 * brief Set power down groups that each internal module placed to.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param groupConfig Pointer to the pf5020_power_down_group_config_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerDownGroups(pf5020_handle_t *handle, const pf5020_power_down_group_config_t *groupConfig)
{
    assert(handle);
    assert(groupConfig);

    status_t status;

    status = PF5020_ModifyReg(handle, PF5020_PWRUP_CTRL,
                              PF5020_PWRUP_CTRL_PGOOD_PDGRP_MASK | PF5020_PWRUP_CTRL_RESETBMCU_PDGRP_MASK,
                              PF5020_PWRUP_CTRL_RESETBMCU_PDGRP(groupConfig->resetBMCUGroup) |
                                  PF5020_PWRUP_CTRL_PGOOD_PDGRP(groupConfig->pGoodGroup));

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_SW1_MODE, PF5020_BUCK_REGULATOR_PDGPR_MASK,
                                  PF5020_BUCK_REGULATOR_PDGPR(groupConfig->sw1Group));
    }
    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_SW2_MODE1, PF5020_BUCK_REGULATOR_PDGPR_MASK,
                                  PF5020_BUCK_REGULATOR_PDGPR(groupConfig->sw2Group));
    }
    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_SWND1_MODE1, PF5020_BUCK_REGULATOR_PDGPR_MASK,
                                  PF5020_BUCK_REGULATOR_PDGPR(groupConfig->swnd1Group));
    }
    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_LDO1_CONFIG2, PF5020_LDO1_CONFIG2_LDO1_PDGRP_MASK,
                                  PF5020_LDO1_CONFIG2_LDO1_PDGRP(groupConfig->ldo1Group));
    }

    return status;
}

/*!
 * brief Set selected power down group's delay.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param group The selected power down group, please refer to pf5020_power_down_group_t for details.
 * param delay The delay value to be set, please refer to pf5020_power_down_delay_t for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetPowerDownGroupDelay(pf5020_handle_t *handle,
                                       pf5020_power_down_group_t group,
                                       pf5020_power_down_delay_t delay)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_PWRDN_DLY1, (0x3U << (2U * (3U - (uint8_t)group))),
                            (uint8_t)delay << (2U * (3U - (uint8_t)group)));
}

/*!
 * brief Set delay to disable the regulators after RESETBMCU is asserted.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param delay The delay value, please refer to pf5020_resetBMCU_delay_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetResetBMcuPinDelay(pf5020_handle_t *handle, pf5020_resetBMCU_delay_t delay)
{
    assert(handle);

    return PF5020_WriteReg(handle, PF5020_PWRDN_DLY2, (uint8_t)delay);
}

/*!
 * brief Turn off PF5020 PMIC.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_TurnOffPMIC(pf5020_handle_t *handle)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_CTRL3, PF5020_CTRL3_PMIC_OFF_MASK, PF5020_CTRL3_PMIC_OFF_MASK);
}

/*!
 * brief Configure internal high speed clock.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config The pointer to pf5020_high_speed_clk_config_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_CLK_ConfigHighSpeedClock(pf5020_handle_t *handle, const pf5020_high_speed_clk_config_t *config)
{
    assert(handle);
    assert(config);

    uint8_t tmp8;

    tmp8 = ((uint8_t)(config->clkFreq) | ((uint8_t)(config->enableSS) << 5U) | ((uint8_t)(config->ssRange) << 4U));
    return PF5020_ModifyReg(handle, PF5020_FREQ_CTRL, 0x3FU, tmp8);
}

/*!
 * brief Enable/disable clock sync out.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Used to enable/disable sync output.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_CLK_EnableSyncOut(pf5020_handle_t *handle, bool enable)
{
    return PF5020_ModifyReg(handle, PF5020_FREQ_CTRL, 0x80U, enable ? 0x80U : 0U);
}

/*!
 * brief Set VSNS LDO output voltage.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param voltage The output voltage of VSNVS, please refer to pf5020_vsnvs_ldo_output_voltage_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetVsnvsLdoOutputVoltage(pf5020_handle_t *handle, pf5020_vsnvs_ldo_output_voltage_t voltage)
{
    assert(handle);

    return PF5020_WriteReg(handle, PF5020_VSNVS_CONFIG1, (uint8_t)voltage);
}

/* SW1 Buck Regulator Control APIs. */
/*!
 * brief Set SW1 Buck regulator global configuration.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config The pointer to pf5020_sw1_regulator_config_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_sw1_regulator_config_t *config)
{
    assert(handle);
    assert(config);

    status_t status;
    uint8_t value         = 0U;
    uint8_t mask          = 0U;
    bool enableILIMBypass = true;

