solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    /* Set SW1 DVS Ramp. */
    status = PF5020_ModifyReg(handle, PF5020_SW_RAMP, 0x7U, (uint8_t)(config->sw1DvsRamp));

    if (status == kStatus_Success)
    {
        /* Set SW1 output voltage in run state. */
        status = PF5020_WriteReg(handle, PF5020_SW1_RUN_VOLT, config->sw1RunOutputVolt);
    }
    if (status == kStatus_Success)
    {
        /* Set SW1 output voltage in standby state. */
        status = PF5020_WriteReg(handle, PF5020_SW1_STBY_VOLT, config->sw1StandbyOutputVolt);
    }

    if (status == kStatus_Success)
    {
        /* Update operate mode in run/standby state. */
        status = PF5020_ModifyReg(handle, PF5020_SW1_MODE,
                                  PF5020_BUCK_REGULATOR_RUN_MODE_MASK | PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_RUN_MODE(config->sw1RunOperateMode) |
                                      PF5020_BUCK_REGULATOR_STANDBY_MODE(config->sw1StandbyOperateMode));
    }
    if (status == kStatus_Success)
    {
        if (config->sw1CurrentLimit != kPF5020_BuckRegulatorCurrentLimitBypass)
        {
            enableILIMBypass = false;
            value |= PF5020_BUCK_REGULATOR_ILIM(config->sw1CurrentLimit);
            mask |= PF5020_BUCK_REGULATOR_ILIM_MASK;
        }

        status = PF5020_SetRegulatorCommonConfig(
            handle, kPF5020_BuckRegulatorSw1, config->sw1EnableUVBypass, config->sw1EnableOVBypass,
            config->sw1EnableWatchdogBypass, config->sw1EnablePGMonitor, config->sw1FaultReEnabled, enableILIMBypass);

        if (status == kStatus_Success)
        {
            value |= PF5020_BUCK_REGULATOR_PHASE(config->sw1PhaseShift);
            mask |= PF5020_BUCK_REGULATOR_PHASE_MASK;
            /* Set SW1 Config2 register, this register can be used to set current limitation value and phase shift.  */
            status = PF5020_ModifyReg(handle, PF5020_SW1_CONFIG2, mask, value);
        }
    }

    return status;
}

/*!
 * brief Set DVS Ramp for SW1 buck regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param dvsRamp The DVS ramp value to set, please refer to pf5020_type1_buck_regulator_dvs_ramp_t for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetDvsRamp(pf5020_handle_t *handle, pf5020_type1_buck_regulator_dvs_ramp_t dvsRamp)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_SW_RAMP, 0x3U, (uint8_t)dvsRamp);
}

/*!
 * brief Set SW1 regulator's output voltage and operate mode in run state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param runOutputVolt The output voltage of SW1 in run state.
 * param runOperateMode The operate mode of SW1 in run state.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetRunStateOption(pf5020_handle_t *handle,
                                      uint8_t runOutputVolt,
                                      pf5020_buck_regulator_operate_mode_t runOperateMode)
{
    assert(handle);

    uint8_t sw1RunMode;
    uint8_t sw1RunVolt;
    status_t status = kStatus_Success;

    (void)PF5020_ReadReg(handle, PF5020_SW1_MODE, &sw1RunMode);
    sw1RunMode &= PF5020_BUCK_REGULATOR_RUN_MODE_MASK;
    sw1RunMode = sw1RunMode >> PF5020_BUCK_REGULATOR_RUN_MODE_SHIFT;
    (void)PF5020_ReadReg(handle, PF5020_SW1_RUN_VOLT, &sw1RunVolt);

    if (sw1RunVolt != runOutputVolt)
    {
        status = PF5020_WriteReg(handle, PF5020_SW1_RUN_VOLT, runOutputVolt);
    }
    if ((sw1RunMode != (uint8_t)runOperateMode) && (status == kStatus_Success))
    {
        status = PF5020_ModifyReg(handle, PF5020_SW1_MODE, PF5020_BUCK_REGULATOR_RUN_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_RUN_MODE(runOperateMode));
    }

    return status;
}

/*!
 * brief Set SW1 regulator's output voltage and operate mode in standby state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param standbyOutputVolt The output voltage of SW1 in standby state.
 * param standbyOperateMode The operate mode of SW1 in standby state.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetStandbyStateOption(pf5020_handle_t *handle,
                                          uint8_t standbyOutputVolt,
                                          pf5020_buck_regulator_operate_mode_t standbyOperateMode)
{
    assert(handle);

    uint8_t sw1StandbyMode;
    uint8_t sw1StandbyVolt;
    status_t status = kStatus_Success;

    (void)PF5020_ReadReg(handle, PF5020_SW1_MODE, &sw1StandbyMode);
    sw1StandbyMode &= PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK;
    sw1StandbyMode = sw1StandbyMode >> PF5020_BUCK_REGULATOR_STANDBY_MODE_SHIFT;

    (void)PF5020_ReadReg(handle, PF5020_SW1_STBY_VOLT, &sw1StandbyVolt);

    if (sw1StandbyVolt != standbyOutputVolt)
    {
        status = PF5020_WriteReg(handle, PF5020_SW1_STBY_VOLT, standbyOutputVolt);
    }

    if ((sw1StandbyMode != (uint8_t)standbyOperateMode) && (status == kStatus_Success))
    {
        status = PF5020_ModifyReg(handle, PF5020_SW1_MODE, PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_STANDBY_MODE(standbyOperateMode));
    }

    return status;
}

/*!
 * brief Set SW1 regulator fault detection related options.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param currentLimit SW1 buck regulator current limitation value, please refer to
 *                      pf5020_buck_regulator_current_limit_t for details.
 * param enableUVBypass Enable/disable UV bypass.
 * param enableOVBypass Enable/disable OV bypass.
 * param faultReEnabled Used to control whether return to sw1 regulator previous state if fault condition is cleared.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetFaultDetection(pf5020_handle_t *handle,
                                      pf5020_buck_regulator_current_limit_t currentLimit,
                                      bool enableUVBypass,
                                      bool enableOVBypass,
                                      bool faultReEnabled)
{
    assert(handle);

    status_t status;
    bool enableILIMBypass   = false;
    uint8_t sw1Config2Mask  = 0U;
    uint8_t sw1Config2Value = 0U;

