solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    if (currentLimit == kPF5020_BuckRegulatorCurrentLimitBypass)
    {
        enableILIMBypass = true;
    }
    else
    {
        sw1Config2Mask |= PF5020_BUCK_REGULATOR_ILIM_MASK;
        sw1Config2Value |= PF5020_BUCK_REGULATOR_ILIM(currentLimit);
    }

    sw1Config2Mask |= PF5020_REGULATOR_FLT_REN_MASK;
    sw1Config2Value |= PF5020_REGULATOR_FLT_REN(faultReEnabled);
    status = PF5020_ModifyReg(handle, PF5020_SW1_CONFIG2, sw1Config2Mask, sw1Config2Value);

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(
            handle, PF5020_SW1_CONFIG1,
            PF5020_REGULATOR_ILIM_BYPASS_MASK | PF5020_REGULATOR_OV_BYPASS_MASK | PF5020_REGULATOR_UV_BYPASS_MASK,
            PF5020_REGULATOR_ILIM_BYPASS(enableILIMBypass) | PF5020_REGULATOR_OV_BYPASS(enableOVBypass) |
                PF5020_REGULATOR_UV_BYPASS(enableUVBypass));
    }

    return status;
}

/*!
 * brief Set SW1 regulator phase shift value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param phaseShift SW1 buck regulator phase shift value, please refer to pf5020_buck_regulator_phase_shift_t
 *                   for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_SetPhaseShift(pf5020_handle_t *handle, pf5020_buck_regulator_phase_shift_t phaseShift)
{
    assert(handle);

    status_t status = kStatus_Success;
    uint8_t sw1Phase;

    (void)PF5020_ReadReg(handle, PF5020_SW1_CONFIG2, &sw1Phase);
    sw1Phase &= PF5020_BUCK_REGULATOR_PHASE_MASK;
    sw1Phase = sw1Phase >> PF5020_BUCK_REGULATOR_PHASE_SHIFT;

    if (sw1Phase != (uint8_t)phaseShift)
    {
        status = PF5020_ModifyReg(handle, PF5020_SW1_CONFIG2, PF5020_BUCK_REGULATOR_PHASE_MASK,
                                  PF5020_BUCK_REGULATOR_PHASE(phaseShift));
    }

    return status;
}

/*!
 * brief Enable/disable PG monitor for SW1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable PG monitor.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_EnablePGMonitor(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_SW1_CONFIG1, PF5020_REGULATOR_PG_EN_MASK, PF5020_REGULATOR_PG_EN(enable));
}

/*!
 * brief Enable/disable watchdog bypass for SW1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable watchdog bypass.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW1_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_SW1_CONFIG1, PF5020_REGULATOR_WDBYPASS_MASK,
                            PF5020_REGULATOR_WDBYPASS(enable));
}

/*!
 * brief Set SW2 Buck regulator global configuration.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config The pointer to pf5020_sw2_regulator_config_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_sw2_regulator_config_t *config)
{
    assert(handle);
    assert(config);

    status_t status;
    uint8_t value         = 0U;
    uint8_t mask          = 0U;
    bool enableILIMBypass = true;

    /* Set SW2 DVS Ramp. */
    status = PF5020_ModifyReg(handle, PF5020_SW_RAMP, 0xCU, ((uint8_t)config->sw2DvsRamp) << 2U);

    if (status == kStatus_Success)
    {
        /* Set SW2 output voltage in run state. */
        status = PF5020_WriteReg(handle, PF5020_SW2_RUN_VOLT, config->sw2RunOutputVolt);
    }
    if (status == kStatus_Success)
    {
        /* Set SW2 output voltage in standby state. */
        status = PF5020_WriteReg(handle, PF5020_SW2_STBY_VOLT, config->sw2StandbyOutputVolt);
    }

    if (status == kStatus_Success)
    {
        /* Update SW2 operate mode in run/standby state. */
        status = PF5020_ModifyReg(handle, PF5020_SW2_MODE1,
                                  PF5020_BUCK_REGULATOR_RUN_MODE_MASK | PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_RUN_MODE(config->sw2RunOperateMode) |
                                      PF5020_BUCK_REGULATOR_STANDBY_MODE(config->sw2StandbyOperateMode));
    }
    if (status == kStatus_Success)
    {
        if (config->sw2CurrentLimit != kPF5020_BuckRegulatorCurrentLimitBypass)
        {
            enableILIMBypass = false;
            value |= PF5020_BUCK_REGULATOR_ILIM(config->sw2CurrentLimit);
            mask |= PF5020_BUCK_REGULATOR_ILIM_MASK;
        }
        status = PF5020_SetRegulatorCommonConfig(
            handle, kPF5020_BuckRegulatorSw2, config->sw2EnableUVBypass, config->sw2EnableOVBypass,
            config->sw2EnableWatchdogBypass, config->sw2EnablePGMonitor, config->sw2FaultReEnabled, enableILIMBypass);

        if (status == kStatus_Success)
        {
            value |= PF5020_BUCK_REGULATOR_PHASE(config->sw2PhaseShift) |
                     PF5020_SW2_CONFIG2_VTTEN(config->sw2EnableVTTOperation);
            mask |= PF5020_BUCK_REGULATOR_PHASE_MASK | PF5020_SW2_CONFIG2_VTTEN_MASK;
            /* Update SW2 CONFIG2 register, this register can be used to set current limitation and phase shift. */
            status = PF5020_ModifyReg(handle, PF5020_SW2_CONFIG2, mask, value);
        }
    }

