solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    return status;
}

/*!
 * brief Set DVS Ramp for SW2 buck regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param dvsRamp The DVS ramp value to set, please refer to pf5020_type1_buck_regulator_dvs_ramp_t for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetDvsRamp(pf5020_handle_t *handle, pf5020_type1_buck_regulator_dvs_ramp_t dvsRamp)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_SW_RAMP, 0xCU, ((uint8_t)dvsRamp << 2U));
}

/*!
 * brief Set SW2 regulator's output voltage and operate mode in run state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param runOutputVolt The output voltage of SW2 in run state.
 * param runOperateMode The operate mode of SW2 in run state.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetRunStateOption(pf5020_handle_t *handle,
                                      uint8_t runOutputVolt,
                                      pf5020_buck_regulator_operate_mode_t runOperateMode)
{
    assert(handle);

    uint8_t sw2RunMode;
    uint8_t sw2RunVolt;
    status_t status = kStatus_Success;

    (void)PF5020_ReadReg(handle, PF5020_SW2_MODE1, &sw2RunMode);
    sw2RunMode &= PF5020_BUCK_REGULATOR_RUN_MODE_MASK;
    sw2RunMode = sw2RunMode >> PF5020_BUCK_REGULATOR_RUN_MODE_SHIFT;
    (void)PF5020_ReadReg(handle, PF5020_SW2_RUN_VOLT, &sw2RunVolt);

    if (sw2RunVolt != runOutputVolt)
    {
        status = PF5020_WriteReg(handle, PF5020_SW2_RUN_VOLT, runOutputVolt);
    }
    if ((sw2RunMode != (uint8_t)runOperateMode) && (status == kStatus_Success))
    {
        status = PF5020_ModifyReg(handle, PF5020_SW2_MODE1, PF5020_BUCK_REGULATOR_RUN_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_RUN_MODE(runOperateMode));
    }

    return status;
}

/*!
 * brief Set SW2 regulator's output voltage and operate mode in standby state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param standbyOutputVolt The output voltage of SW2 in standby state.
 * param standbyOperateMode The operate mode of SW2 in standby state.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetStandbyStateOption(pf5020_handle_t *handle,
                                          uint8_t standbyOutputVolt,
                                          pf5020_buck_regulator_operate_mode_t standbyOperateMode)
{
    assert(handle);

    uint8_t sw2StandbyMode;
    uint8_t sw2StandbyVolt;
    status_t status = kStatus_Success;

    (void)PF5020_ReadReg(handle, PF5020_SW2_MODE1, &sw2StandbyMode);
    sw2StandbyMode &= PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK;
    sw2StandbyVolt = sw2StandbyMode >> PF5020_BUCK_REGULATOR_STANDBY_MODE_SHIFT;

    (void)PF5020_ReadReg(handle, PF5020_SW2_STBY_VOLT, &sw2StandbyVolt);

    if (sw2StandbyVolt != standbyOutputVolt)
    {
        status = PF5020_WriteReg(handle, PF5020_SW2_STBY_VOLT, standbyOutputVolt);
    }

    if ((sw2StandbyMode != (uint8_t)standbyOperateMode) && (status == kStatus_Success))
    {
        status = PF5020_ModifyReg(handle, PF5020_SW2_MODE1, PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_STANDBY_MODE(standbyOperateMode));
    }

    return status;
}

/*!
 * brief Set SW2 regulator phase shift value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param phaseShift SW2 buck regulator phase shift value, please refer to pf5020_buck_regulator_phase_shift_t
 *                   for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetPhaseShift(pf5020_handle_t *handle, pf5020_buck_regulator_phase_shift_t phaseShift)
{
    assert(handle);

    status_t status = kStatus_Success;
    uint8_t sw2Phase;

    (void)PF5020_ReadReg(handle, PF5020_SW2_CONFIG2, &sw2Phase);
    sw2Phase &= PF5020_BUCK_REGULATOR_PHASE_MASK;
    sw2Phase = sw2Phase >> PF5020_BUCK_REGULATOR_PHASE_SHIFT;

    if (sw2Phase != (uint8_t)phaseShift)
    {
        status = PF5020_ModifyReg(handle, PF5020_SW2_CONFIG2, PF5020_BUCK_REGULATOR_PHASE_MASK,
                                  PF5020_BUCK_REGULATOR_PHASE(phaseShift));
    }

    return status;
}

/*!
 * brief Enable/disable SW2 VTT operateion.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Used to enable/disable VTT operation.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_EnableVTTOperation(pf5020_handle_t *handle, bool enable)
{
    return PF5020_ModifyReg(handle, PF5020_SW2_CONFIG2, PF5020_SW2_CONFIG2_VTTEN_MASK,
                            PF5020_SW2_CONFIG2_VTTEN(enable));
}

/*!
 * brief Set SW2 regulator fault detection related options.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param currentLimit SW2 buck regulator current limitation value, please refer to
 *                      pf5020_buck_regulator_current_limit_t for details.
 * param enableUVBypass Enable/disable UV bypass.
 * param enableOVBypass Enable/disable OV bypass.
 * param faultReEnabled Used to control whether return to sw1 regulator previous state if fault condition is cleared.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_SetFaultDetection(pf5020_handle_t *handle,
                                      pf5020_buck_regulator_current_limit_t currentLimit,
                                      bool enableUVBypass,
                                      bool enableOVBypass,
                                      bool faultReEnabled)
{
    assert(handle);

    status_t status;
    bool enableILIMBypass   = false;
    uint8_t sw2Config2Mask  = 0U;
    uint8_t sw2Config2Value = 0U;

