solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    if (currentLimit == kPF5020_BuckRegulatorCurrentLimitBypass)
    {
        enableILIMBypass = true;
    }
    else
    {
        sw2Config2Mask |= PF5020_BUCK_REGULATOR_ILIM_MASK;
        sw2Config2Value |= PF5020_BUCK_REGULATOR_ILIM(currentLimit);
    }

    sw2Config2Mask |= PF5020_REGULATOR_FLT_REN_MASK;
    sw2Config2Value |= PF5020_REGULATOR_FLT_REN(faultReEnabled);
    status = PF5020_ModifyReg(handle, PF5020_SW1_CONFIG2, sw2Config2Mask, sw2Config2Value);

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(
            handle, PF5020_SW1_CONFIG1,
            PF5020_REGULATOR_ILIM_BYPASS_MASK | PF5020_REGULATOR_OV_BYPASS_MASK | PF5020_REGULATOR_UV_BYPASS_MASK,
            PF5020_REGULATOR_ILIM_BYPASS(enableILIMBypass) | PF5020_REGULATOR_OV_BYPASS(enableOVBypass) |
                PF5020_REGULATOR_UV_BYPASS(enableUVBypass));
    }

    return status;
}

/*!
 * brief Enable/disable PG monitor for SW2 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable PG monitor.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_EnablePGMonitor(pf5020_handle_t *handle, bool enable)
{
    return PF5020_ModifyReg(handle, PF5020_SW2_CONFIG1, PF5020_REGULATOR_PG_EN_MASK, PF5020_REGULATOR_PG_EN(enable));
}

/*!
 * brief Enable/disable watchdog bypass for SW2 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable watchdog bypass.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SW2_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable)
{
    return PF5020_ModifyReg(handle, PF5020_SW2_CONFIG1, PF5020_REGULATOR_WDBYPASS_MASK,
                            PF5020_REGULATOR_WDBYPASS(enable));
}

/*!
 * brief Set SWND1 Buck regulator global configuration.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config The pointer to pf5020_swnd1_regulator_config_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_swnd1_regulator_config_t *config)
{
    assert(handle);
    assert(config);

    status_t status       = kStatus_Success;
    uint8_t value         = 0U;
    uint8_t mask          = 0U;
    bool enableILIMBypass = true;

    /* Set output voltage in run/standby state. */
    status = PF5020_WriteReg(handle, PF5020_SWND1_RUN_VOLT, (uint8_t)(config->swnd1OutputVolt));

    if (status == kStatus_Success)
    {
        /* Set SWND1 operate mode in run/standby state. */
        status = PF5020_ModifyReg(handle, PF5020_SWND1_MODE1,
                                  PF5020_BUCK_REGULATOR_RUN_MODE_MASK | PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK,
                                  PF5020_BUCK_REGULATOR_RUN_MODE(config->swnd1RunOperateMode) |
                                      PF5020_BUCK_REGULATOR_STANDBY_MODE(config->swnd1StandbyOperateMode));
    }

    if (status == kStatus_Success)
    {
        if (config->swnd1CurrentLimit != kPF5020_BuckRegulatorCurrentLimitBypass)
        {
            enableILIMBypass = false;
            value |= PF5020_BUCK_REGULATOR_ILIM(config->swnd1CurrentLimit);
            mask |= PF5020_BUCK_REGULATOR_ILIM_MASK;
        }
        status = PF5020_SetRegulatorCommonConfig(handle, kPF5020_BuckRegulatorSwnd1, config->swnd1EnableUVBypass,
                                                 config->swnd1EnableOVBypass, config->swnd1EnableWatchdogBypass,
                                                 config->swnd1EnablePGMonitor, config->swnd1FaultReEnabled,
                                                 enableILIMBypass);

        if (status == kStatus_Success)
        {
            value |= PF5020_BUCK_REGULATOR_PHASE(config->swnd1PhaseShift);
            mask |= PF5020_BUCK_REGULATOR_PHASE_MASK;
            /* Update SWND1 CONFIG2 register, this register can be used to set current limitation and phase shift. */
            status = PF5020_ModifyReg(handle, PF5020_SWND1_CONFIG2, mask, value);
        }
    }

    return status;
}

/*!
 * brief Set run/standby output voltage for SWND1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param outputVolt The output voltage of SWND1 regulator in run/standby state,
 *                  please refer to pf5020_swnd1_output_voltage_t for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetOutputVoltage(pf5020_handle_t *handle, pf5020_swnd1_output_voltage_t outputVolt)
{
    assert(handle);

    uint8_t swnd1Volt;
    status_t status = kStatus_Success;

    (void)PF5020_ReadReg(handle, PF5020_SWND1_RUN_VOLT, &swnd1Volt);

    if (swnd1Volt != (uint8_t)outputVolt)
    {
        status = PF5020_WriteReg(handle, PF5020_SWND1_RUN_VOLT, (uint8_t)outputVolt);
    }

    return status;
}

/*!
 * brief Set SWND1 regulator's operate mode in run and standby state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param runOperateMode The operate mode of SWND1 in run state, please refer to pf5020_buck_regulator_operate_mode_t.
 * param standbyOperateMode The operate mode of SWND1 in standby state, please refer to
 * pf5020_buck_regulator_operate_mode_t. retval #kStatus_Success The transaction was started successfully. retval
 * #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking transaction is already in
 * progress.
 */
status_t PF5020_SWND1_SetOperateMode(pf5020_handle_t *handle,
                                     pf5020_buck_regulator_operate_mode_t runOperateMode,
                                     pf5020_buck_regulator_operate_mode_t standbyOperateMode)
{
    assert(handle);

