solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    uint8_t tmp8;
    uint8_t swnd1RunMode;
    uint8_t swnd1StandbyMode;
    status_t status;

    (void)PF5020_ReadReg(handle, PF5020_SWND1_MODE1, &tmp8);

    swnd1RunMode     = (tmp8 & PF5020_BUCK_REGULATOR_RUN_MODE_MASK);
    swnd1StandbyMode = ((tmp8 & PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK) >> PF5020_BUCK_REGULATOR_STANDBY_MODE_SHIFT);

    if (swnd1RunMode != (uint8_t)runOperateMode)
    {
        tmp8 =
            ((tmp8 & (uint8_t)(~PF5020_BUCK_REGULATOR_RUN_MODE_MASK)) | PF5020_BUCK_REGULATOR_RUN_MODE(runOperateMode));
    }

    if (swnd1StandbyMode != (uint8_t)standbyOperateMode)
    {
        tmp8 = ((tmp8 & (uint8_t)(~PF5020_BUCK_REGULATOR_STANDBY_MODE_MASK)) |
                PF5020_BUCK_REGULATOR_STANDBY_MODE(standbyOperateMode));
    }

    status = PF5020_WriteReg(handle, PF5020_SWND1_MODE1, tmp8);

    return status;
}

/*!
 * brief Set SWND1 regulator phase shift value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param phaseShift SWND1 buck regulator phase shift value, please refer to pf5020_buck_regulator_phase_shift_t
 *                   for details.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetPhaseShift(pf5020_handle_t *handle, pf5020_buck_regulator_phase_shift_t phaseShift)
{
    assert(handle);

    status_t status = kStatus_Success;
    uint8_t swnd1Phase;

    (void)PF5020_ReadReg(handle, PF5020_SWND1_CONFIG2, &swnd1Phase);
    swnd1Phase &= PF5020_BUCK_REGULATOR_PHASE_MASK;
    swnd1Phase = swnd1Phase >> PF5020_BUCK_REGULATOR_PHASE_SHIFT;

    if (swnd1Phase != (uint8_t)phaseShift)
    {
        status = PF5020_ModifyReg(handle, PF5020_SWND1_CONFIG2, PF5020_BUCK_REGULATOR_PHASE_MASK,
                                  PF5020_BUCK_REGULATOR_PHASE(phaseShift));
    }

    return status;
}

/*!
 * brief Set SWND1 regulator fault detection related options.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param currentLimit SWND1 buck regulator current limitation value, please refer to
 *                      pf5020_buck_regulator_current_limit_t for details.
 * param enableUVBypass Enable/disable UV bypass.
 * param enableOVBypass Enable/disable OV bypass.
 * param faultReEnabled Used to control whether return to sw1 regulator previous state if fault condition is cleared.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_SetFaultDetection(pf5020_handle_t *handle,
                                        pf5020_buck_regulator_current_limit_t currentLimit,
                                        bool enableUVBypass,
                                        bool enableOVBypass,
                                        bool faultReEnabled)
{
    assert(handle);

    status_t status;
    bool enableILIMBypass     = false;
    uint8_t swnd1Config2Mask  = 0U;
    uint8_t swnd1Config2Value = 0U;

    if (currentLimit == kPF5020_BuckRegulatorCurrentLimitBypass)
    {
        enableILIMBypass = true;
    }
    else
    {
        swnd1Config2Mask |= PF5020_BUCK_REGULATOR_ILIM_MASK;
        swnd1Config2Value |= PF5020_BUCK_REGULATOR_ILIM(currentLimit);
    }

    swnd1Config2Mask |= PF5020_REGULATOR_FLT_REN_MASK;
    swnd1Config2Value |= PF5020_REGULATOR_FLT_REN(faultReEnabled);
    status = PF5020_ModifyReg(handle, PF5020_SWND1_CONFIG2, swnd1Config2Mask, swnd1Config2Value);

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(
            handle, PF5020_SWND1_CONFIG1,
            PF5020_REGULATOR_ILIM_BYPASS_MASK | PF5020_REGULATOR_OV_BYPASS_MASK | PF5020_REGULATOR_UV_BYPASS_MASK,
            PF5020_REGULATOR_ILIM_BYPASS(enableILIMBypass) | PF5020_REGULATOR_OV_BYPASS(enableOVBypass) |
                PF5020_REGULATOR_UV_BYPASS(enableUVBypass));
    }

    return status;
}

/*!
 * brief Enable/disable PG monitor for SWND1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable PG monitor.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_EnablePGMonitor(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_SWND1_CONFIG1, PF5020_REGULATOR_PG_EN_MASK, PF5020_REGULATOR_PG_EN(enable));
}

/*!
 * brief Enable/disable watchdog bypass for SW1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable watchdog bypass.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SWND1_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_SWND1_CONFIG1, PF5020_REGULATOR_WDBYPASS_MASK,
                            PF5020_REGULATOR_WDBYPASS(enable));
}

/*!
 * brief Set LDO1 global configuration.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config The pointer to pf5020_ldo1_regulator_config structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetGlobalConfig(pf5020_handle_t *handle, const pf5020_ldo1_regulator_config *config)
{
    assert(handle);
    assert(config);

