solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    status_t status = kStatus_Success;

    /* Set LDO1 output voltage in run state. */
    status = PF5020_WriteReg(handle, PF5020_LDO1_RUN_VOLT, (uint8_t)(config->ldo1RunOutputVolt));

    if (status == kStatus_Success)
    {
        /* Set LDO1 output voltage in standby state. */
        status = PF5020_WriteReg(handle, PF5020_LDO1_STBY_VOLT, (uint8_t)(config->ldo1StandbyOutputVolt));
    }

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(
            handle, PF5020_LDO1_CONFIG2, PF5020_LDO1_CONFIG2_RUN_EN_MASK | PF5020_LDO1_CONFIG2_STBY_EN_MASK,
            PF5020_LDO1_CONFIG2_STBY_EN(config->ldo1StandbyEnable) | PF5020_LDO1_CONFIG2_RUN_EN(config->ldo1RunEnable));
    }

    if (status == kStatus_Success)
    {
        status = PF5020_SetRegulatorCommonConfig(handle, kPF5020_RegulatorLdo1, config->ldo1EnableUVBypass,
                                                 config->ldo1EnableOVBypass, config->ldo1EnableWatchdogBypass,
                                                 config->ldo1EnablePGMonitor, config->ldo1FaultReEnabled,
                                                 config->ldo1EnableILIMBypass);
    }

    return status;
}

/*!
 * brief Set LDO1 regulator's output voltage and operate mode in run state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param runEnable Enable/disable LDO1 in run state.
 * param runOuputVolt The output voltage of LDO1 in run state, please refer to pf5020_ldo1_output_voltage_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetRunStateOption(pf5020_handle_t *handle,
                                       bool runEnable,
                                       pf5020_ldo1_output_voltage_t runOuputVolt)
{
    assert(handle);

    status_t status;

    if (runEnable)
    {
        status = PF5020_WriteReg(handle, PF5020_LDO1_RUN_VOLT, (uint8_t)runOuputVolt);
    }
    else
    {
        status = PF5020_ModifyReg(handle, PF5020_LDO1_CONFIG2, PF5020_LDO1_CONFIG2_RUN_EN_MASK,
                                  PF5020_LDO1_CONFIG2_RUN_EN(runEnable));
    }

    return status;
}

/*!
 * brief Set LDO1 regulator's output voltage and operate mode in standby state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param standbyEnable Enable/disable LDO1 in standby state.
 * param standbyOuputVolt The output voltage of LDO1 in standby state, please refer to pf5020_ldo1_output_voltage_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetStandbyStateOption(pf5020_handle_t *handle,
                                           bool standbyEnable,
                                           pf5020_ldo1_output_voltage_t standbyOuputVolt)
{
    assert(handle);

    status_t status;

    if (standbyEnable)
    {
        status = PF5020_WriteReg(handle, PF5020_LDO1_STBY_VOLT, (uint8_t)standbyOuputVolt);
    }
    else
    {
        status = PF5020_ModifyReg(handle, PF5020_LDO1_CONFIG2, PF5020_LDO1_CONFIG2_STBY_EN_MASK,
                                  PF5020_LDO1_CONFIG2_STBY_EN(standbyEnable));
    }

    return status;
}

/*!
 * brief Set SWND1 regulator fault detection related options.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enableILIMBypass Enable/disable ILIM bypass.
 * param enableUVBypass Enable/disable UV bypass.
 * param enableOVBypass Enable/disable OV bypass.
 * param faultReEnabled Used to control whether return to ldos1 regulator previous state if fault condition is cleared.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_SetFaultDetection(
    pf5020_handle_t *handle, bool enableILIMBypass, bool enableUVBypass, bool enableOVBypass, bool faultReEnabled)
{
    assert(handle);

    status_t status;

    status = PF5020_ModifyReg(
        handle, PF5020_LDO1_CONFIG1,
        PF5020_REGULATOR_ILIM_BYPASS_MASK | PF5020_REGULATOR_OV_BYPASS_MASK | PF5020_REGULATOR_UV_BYPASS_MASK,
        PF5020_REGULATOR_ILIM_BYPASS(enableILIMBypass) | PF5020_REGULATOR_OV_BYPASS(enableOVBypass) |
            PF5020_REGULATOR_UV_BYPASS(enableUVBypass));

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_LDO1_CONFIG2, PF5020_REGULATOR_FLT_REN_MASK,
                                  PF5020_REGULATOR_FLT_REN(faultReEnabled));
    }

    return status;
}

/*!
 * brief Enable/disable PG monitor for LDO1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable PG monitor.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_EnablePGMonitor(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_LDO1_CONFIG1, PF5020_REGULATOR_PG_EN_MASK, PF5020_REGULATOR_PG_EN(enable));
}

/*!
 * brief Enable/disable watchdog bypass for LDO1 regulator.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable watchdog bypass.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_LDO1_EnableWatchDogBypass(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

