solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    return PF5020_ModifyReg(handle, PF5020_LDO1_CONFIG1, PF5020_REGULATOR_WDBYPASS_MASK,
                            PF5020_REGULATOR_WDBYPASS(enable));
}

/*!
 * brief Set voltage monitor debounce time.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param uvDebounceTime UV monitor debounce time, please refer to pf5020_uv_debounce_time_t.
 * param ovDebounceTime OV monitor debounce time, please refer to pf5020_ov_debounce_time_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetVoltageMonitorDebounceTime(pf5020_handle_t *handle,
                                              pf5020_uv_debounce_time_t uvDebounceTime,
                                              pf5020_ov_debounce_time_t ovDebounceTime)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_CTRL3, PF5020_CTRL3_UV_DB_MASK | PF5020_CTRL3_OV_DB_MASK,
                            PF5020_CTRL3_UV_DB(uvDebounceTime) | PF5020_CTRL3_OV_DB(ovDebounceTime));
}

/*!
 * brief Enable/disable selected regulator's voltage monitor.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param name The regulator to be set.
 * param enable Enable/disable voltage monitor.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_EnableVoltageMonitor(pf5020_handle_t *handle, pf5020_regulator_name_t name, bool enable)
{
    assert(handle);

    status_t status = kStatus_Success;

    switch (name)
    {
        case kPF5020_BuckRegulatorSw1:
        {
            status = PF5020_ModifyReg(handle, PF5020_VMONEN1, PF5020_VMONEN1_SW1VMON_EN_MASK,
                                      PF5020_VMONEN1_SW1VMON_EN(enable));
            break;
        }
        case kPF5020_BuckRegulatorSw2:
        {
            status = PF5020_ModifyReg(handle, PF5020_VMONEN1, PF5020_VMONEN1_SW2VMON_EN_MASK,
                                      PF5020_VMONEN1_SW2VMON_EN(enable));
            break;
        }
        case kPF5020_BuckRegulatorSwnd1:
        {
            status = PF5020_ModifyReg(handle, PF5020_VMONEN1, PF5020_VMONEN1_SWND1VMON_EN_MASK,
                                      PF5020_VMONEN1_SWND1VMON_EN(enable));
            break;
        }
        case kPF5020_RegulatorLdo1:
        {
            status = PF5020_ModifyReg(handle, PF5020_VMONEN2, PF5020_VMONEN2_LDO1VMON_EN_MASK,
                                      PF5020_VMONEN2_LDO1VMON_EN(enable));
            break;
        }
        default:
        {
            assert(false);
            break;
        }
    }

    return status;
}

/*!
 * brief Set fault counter maximum value.
 *
 * param handle Pointer to the pf5020_handle_t structure.
 * param maxValue Ranges from 0 to 15.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetFaultCounterMaxValue(pf5020_handle_t *handle, uint8_t maxValue)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_FAULT_COUNTER, 0xF0U, ((maxValue << 4U) & 0xF0U));
}

/*!
 * brief Get fault counter current value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
uint8_t PF5020_GetFaultCounterCurrentValue(pf5020_handle_t *handle)
{
    assert(handle);

    uint8_t tmp8;

    (void)PF5020_ReadReg(handle, PF5020_FAULT_COUNTER, &tmp8);
    tmp8 = tmp8 & 0x0FU;

    return tmp8;
}

/*!
 * brief Set the expire value of the fault timer, when a regulator experiences a fault event, a fault timer will start.
 *
 * param handle Pointer to the pf5020_handle_t structure.
 * param expireValue The expire value of fault timer, ranges from 0 to 11, the actual expire time = 2 ^ expireValue.
 *
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_SetFaultTimerExpireValue(pf5020_handle_t *handle, uint8_t expireValue)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_FAULT_TIMERS, 0x0FU, (expireValue & 0x0FU));
}

/*!
 * brief Set reset behaviour asserted by WDI.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param wdiMode Used to control the WDI asserted performs a hard WD reset or soft WD reset.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_SetWDIMode(pf5020_handle_t *handle, pf5020_wdi_mode_t wdiMode)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_CTRL1, 0x20U, (((uint8_t)wdiMode << 5U) & 0x20U));
}

/*!
 * brief Enable/disable WDI watchdog event in standby state.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Used to control whether generate a watchdog event in standby mode if the WDI is asserted.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_EnableWDIStanby(pf5020_handle_t *handle, bool enable)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_CTRL1, 0x2U, (((uint8_t)enable << 1U) & 0x2U));
}

/*!
 * brief Configure internal watchdog timer.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param config Pointer to pf5020_wdog_internal_timer_config_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_ConfigInternalTimer(pf5020_handle_t *handle, const pf5020_wdog_internal_timer_config_t *config)
{
    assert(handle);
    assert(config);

    status_t status;

