solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
    status = PF5020_WriteReg(handle, PF5020_WD_CONFIG, config->timerDuration);

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_WD_EXPIRE, 0x70U, ((config->cyclicCounterMaxVale << 4U) & 0x70U));
    }

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_CTRL1, PF5020_CTRL1_WD_EN_MASK | PF5020_CTRL1_WD_STBY_EN_MASK,
                                  PF5020_CTRL1_WD_STBY_EN(config->enableStandby) | PF5020_CTRL1_WD_EN(config->enable));
    }

    return status;
}

/*!
 * brief Get cyclic counter current value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * return Current cyclic counter value.
 */
uint8_t PF5020_WDOG_GetCyclicCounterValue(pf5020_handle_t *handle)
{
    assert(handle);

    uint8_t tmp8;

    (void)PF5020_ReadReg(handle, PF5020_WD_EXPIRE, &tmp8);
    tmp8 &= 0x7U;

    return tmp8;
}

/*!
 * brief Refresh internal watchdog timer.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_RefreshInternalTimer(pf5020_handle_t *handle)
{
    assert(handle);

    return PF5020_WriteReg(handle, PF5020_WD_CLEAR, 0x1U);
}

/*!
 * brief Set watchdog event counter maximum value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param maxValue The maximum value of watchdog event counter.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_WDOG_SetWDEventCounterMaxValue(pf5020_handle_t *handle, uint8_t maxValue)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_WD_COUNTER, 0xF0U, ((maxValue << 4U) & 0xF0U));
}

/*!
 * brief Get watchdog event counter current value.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * return Watch dog event counter current value.
 */
uint8_t PF5020_WDOG_GetWDEventCounterCurrentValue(pf5020_handle_t *handle)
{
    assert(handle);

    uint8_t tmp8;

    (void)PF5020_ReadReg(handle, PF5020_WD_COUNTER, &tmp8);
    tmp8 &= 0xFU;

    return tmp8;
}

/*!
 * brief Configure internal thermal monitor.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable temperature sensor circuit.
 * param mode Used to set temperature sensor operate mode, please refer to pf5020_temp_sensor_operate_mode_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_TMP_SetThermalMonitorConfig(pf5020_handle_t *handle,
                                            bool enable,
                                            pf5020_temp_sensor_operate_mode_t mode)
{
    assert(handle);

    status_t status;

    status = PF5020_ModifyReg(handle, PF5020_CTRL1, PF5020_CTRL1_TMP_MON_EN_MASK, PF5020_CTRL1_TMP_MON_EN(enable));

    if (status == kStatus_Success)
    {
        status = PF5020_ModifyReg(handle, PF5020_CTRL2, PF5020_CTRL2_TMP_MON_AON_MASK, PF5020_CTRL2_TMP_MON_AON(mode));
    }

    return status;
}

/*!
 * brief Configure analog multiplexer.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param enable Enable/disable analog multiplexer.
 * param amuxSel Used to select amux output, please refer to pf5020_amux_selection_t
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_AMUX_SetAnalogMuxConfig(pf5020_handle_t *handle, bool enable, pf5020_amux_selection_t amuxSel)
{
    assert(handle);

    return PF5020_ModifyReg(handle, PF5020_AMUX, PF5020_AMUX_AMUX_SEL_MASK | PF5020_AMUX_AMUX_EN_MASK,
                            PF5020_AMUX_MAUX_SEL(amuxSel) | PF5020_AMUX_AMUX_EN(enable));
}

/*!
 * brief Enable interrupts.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param interruptMask The mask of interrupts to clear, should be the OR'ed value of pf5020_interrupt_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_EnableInterrupts(pf5020_handle_t *handle, uint64_t interruptMask)
{
    assert(handle);

    return PF5020_MaskInterrupts(handle, interruptMask, true);
}

/*!
 * brief Disable Interrupts.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param interruptMask The mask of interrupts to clear, should be the OR'ed value of pf5020_interrupt_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_DisableInterrupts(pf5020_handle_t *handle, uint64_t interruptMask)
{
    assert(handle);

    return PF5020_MaskInterrupts(handle, interruptMask, false);
}

/*!
 * brief Get latched interrupts.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param interrptLatched Pointer to store the latched interrupt value.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_GetInterruptLatchStatus(pf5020_handle_t *handle, uint64_t *interrptLatched)
{
    assert(handle);

    static const uint8_t latchRegArray[] = PF5020_INT_LATCH_ARRAY;
    uint8_t sysIntStatus;
    status_t status;
    uint8_t i;
    uint8_t tmp8;

    /* Get first level interrupt latch value, if the bit in SYS_INT register is set, it means related second level
     * interrupts are latched in second level interrupt register.
     */
    status = PF5020_ReadReg(handle, PF5020_SYS_INT, &sysIntStatus);

    if (status == kStatus_Success)
    {
        for (i = 0U; i < 7U; i++)
        {
            /* If first level interrupt is set, then read related second level interrupt latch register. */
            if ((sysIntStatus & (1U << i)) != 0U)
            {
                status = PF5020_ReadReg(handle, latchRegArray[i], &tmp8);
                *interrptLatched |= ((uint64_t)tmp8 << (i * 8U));

