solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/pmic/pf5020/fsl_pf5020.c
                if ((i == 3U) && (status == kStatus_Success))
                {
                    status = PF5020_ReadReg(handle, PF5020_LDO_ILIM_INT, &tmp8);
                    if ((status == kStatus_Success) && (tmp8 != 0U))
                    {
                        *interrptLatched |= (uint64_t)kPF5020_ILIM_Ldo1IlimInterrupt;
                    }
                }

                if ((i == 4U) && (status == kStatus_Success))
                {
                    status = PF5020_ReadReg(handle, PF5020_LDO_UV_INT, &tmp8);
                    if ((tmp8 != 0U) && (status == kStatus_Success))
                    {
                        *interrptLatched |= (uint64_t)kPF5020_UV_Ldo1UvInterrupt;
                    }
                }

                if ((i == 5U) && (status == kStatus_Success))
                {
                    status = PF5020_ReadReg(handle, PF5020_LDO_OV_INT, &tmp8);
                    if ((tmp8 != 0U) && (status == kStatus_Success))
                    {
                        *interrptLatched |= (uint64_t)kPF5020_OV_Ldo1OvInterrupt;
                    }
                }
            }
        }
    }

    return status;
}

/*!
 * brief Clear latched interrupts.
 *
 * param handle The pointer to pf5020_handle_t structure.
 * param interruptMask The mask of interrupts to clear, should be the OR'ed value of pf5020_interrupt_t.
 * retval #kStatus_Success The transaction was started successfully.
 * retval #kStatus_LPI2C_Busy Either another master is currently utilizing the bus, or a non-blocking
 *      transaction is already in progress.
 */
status_t PF5020_ClearInterruptStatus(pf5020_handle_t *handle, uint64_t interruptMask)
{
    assert(handle);

    static const uint8_t latchRegArray[] = PF5020_INT_LATCH_ARRAY;
    status_t status;
    uint8_t sysIntStatus;
    uint8_t i;
    uint8_t tmp8;
    uint64_t tmp64;

    /* Read SYS_INT register, it provides information about the interrupt register that originated the interrupt event.
     */
    status = PF5020_ReadReg(handle, PF5020_SYS_INT, &sysIntStatus);

    for (i = 0U; i < 7U; i++)
    {
        if ((sysIntStatus & (1U << i)) != 0U)
        {
            tmp64 = interruptMask & (0xFFULL << (8ULL * i));
            if ((tmp64 & (uint64_t)kPF5020_ILIM_Ldo1IlimInterrupt) != 0ULL)
            {
                status = PF5020_WriteReg(handle, PF5020_LDO_ILIM_INT, 1U);
                tmp64 &= (uint64_t)(~(uint64_t)kPF5020_ILIM_Ldo1IlimInterrupt);
            }

            if ((tmp64 & (uint64_t)kPF5020_UV_Ldo1UvInterrupt) != 0ULL)
            {
                status = PF5020_WriteReg(handle, PF5020_LDO_UV_INT, 1U);
                tmp64 &= (uint64_t)(~(uint64_t)kPF5020_UV_Ldo1UvInterrupt);
            }

            if ((tmp64 & (uint64_t)kPF5020_OV_Ldo1OvInterrupt) != 0ULL)
            {
                status = PF5020_WriteReg(handle, PF5020_LDO_OV_INT, 1U);
                tmp64 &= (uint64_t)(~(uint64_t)kPF5020_OV_Ldo1OvInterrupt);
            }

            tmp8 = (uint8_t)(tmp64 >> (8ULL * i)) & (0xFFU);

            if (status == kStatus_Success)
            {
                status = PF5020_WriteReg(handle, latchRegArray[i], tmp8);
            }
        }
    }

    return status;
}
